<script setup>
import { agriculturalAreaSummaryThisYearApi } from '@/apis/overview';
import { onMounted, ref } from 'vue';
const agriculturalAreaSummary = ref(null)

// 获取农业概况数据
const agriculturalAreaSummaryThisYear = async () => {
    const res = await agriculturalAreaSummaryThisYearApi()
    agriculturalAreaSummary.value = res.data
}

onMounted(() => {
    agriculturalAreaSummaryThisYear()
})
</script>

<template>
    <section class="panel-box water-quality-panel">
        <div style="display: flex; flex-direction: column; align-items: center;justify-content: center;">
            <svg t="1739709683698" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="1510" width="30" height="30">
                <path
                    d="M810.946385 398.138063V127.312332L763.491287 0H399.541305l-45.158883 127.567467v345.069997h76.54048v115.065854h0.127568v121.444229c19.262687 4.847564 37.75997 13.394584 54.34374 25.896195l28.957815 21.941605v-43.500507h83.811826c42.862669-15.308096 91.338306-10.715667 130.88422 14.032422V587.703318h78.198857v151.550151l5.485401-4.209727c23.089711-17.476743 50.134014-27.427005 77.816155-29.850787v-117.489637h109.197751V398.138063h-188.79985zM453.629911 76.54048h256.79331l19.517823 52.302661H435.005061L453.629911 76.54048z m-22.834576 319.684071V203.980379h303.61057v192.244172H641.664357v-104.73289h-113.79018v104.73289h-97.078842z m214.951181 284.347883h-131.394491v-30.871327h131.394491v30.871327z m0-63.783733h-131.394491v-29.085383h131.394491v29.085383z m277.459239-105.625862H507.463382V474.550976h415.742373v36.611863zM776.375601 1023.984054a112.004236 112.004236 0 0 1-67.865892-22.707009l-37.887537-28.70268c-12.756747-9.695127-30.488625-9.56756-43.117804 0l-37.887538 28.70268c-39.928617 30.23349-95.6756 30.361057-135.604217 0l-37.887537-28.70268c-12.756747-9.695127-30.488625-9.56756-43.117804 0l-37.887537 28.70268c-39.928617 30.23349-95.6756 30.361057-135.604217 0l-37.887538-28.70268c-12.756747-9.56756-30.488625-9.56756-43.117804 0l-49.496177 37.504835a38.244726 38.244726 0 1 1-46.179422-60.977249l49.496177-37.504835c39.928617-30.23349 95.803167-30.23349 135.604216 0l37.887538 28.70268c12.756747 9.56756 30.488625 9.56756 43.117804 0l37.887537-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887538 28.70268c12.756747 9.56756 30.488625 9.56756 43.117804 0l37.887537-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887537 28.70268c12.756747 9.56756 30.488625 9.56756 43.117803 0l37.887538-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887537 28.70268a38.244726 38.244726 0 1 1-46.179422 60.977249l-37.887538-28.70268c-12.756747-9.56756-30.488625-9.56756-43.117804 0l-37.887537 28.70268a112.259371 112.259371 0 0 1-67.865893 22.707009z"
                    p-id="1511" fill="#1afa29"></path>
                <path
                    d="M776.375601 878.046872a112.004236 112.004236 0 0 1-67.865892-22.707009l-37.887537-28.70268c-12.756747-9.695127-30.488625-9.56756-43.117804 0l-37.887538 28.70268c-39.928617 30.23349-95.6756 30.361057-135.604217 0l-37.887537-28.70268c-12.756747-9.695127-30.488625-9.56756-43.117804 0l-37.887537 28.70268c-39.928617 30.23349-95.6756 30.361057-135.604217 0l-37.887538-28.70268c-12.756747-9.695127-30.488625-9.56756-43.117804 0l-37.887537 28.70268c-39.928617 30.23349-95.6756 30.361057-135.604217 0l-37.887538-28.70268c-12.756747-9.56756-30.488625-9.56756-43.117804 0l-49.496177 37.504835a38.244726 38.244726 0 1 1-46.179422-60.977249l49.496177-37.504835c39.928617-30.23349 95.803167-30.23349 135.604216 0l37.887538 28.70268c12.756747 9.56756 30.488625 9.56756 43.117804 0l37.887537-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887538 28.70268c12.756747 9.56756 30.488625 9.56756 43.117804 0l37.887537-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887537 28.70268c12.756747 9.56756 30.488625 9.56756 43.117803 0l37.887538-28.70268c39.928617-30.23349 95.6756-30.361057 135.604217 0l37.887537 28.70268a38.244726 38.244726 0 1 1-46.179422 60.977249l-37.887538-28.70268c-12.756747-9.56756-30.488625-9.56756-43.117804 0l-37.887537 28.70268a112.259371 112.259371 0 0 1-67.865893 22.707009z"
                    p-id="1512" fill="#1afa29"></path>
                <path
                    d="M179.870128 741.294548C80.622639 741.294548 0 660.671909 0 561.42442c0-17.221608 0-69.651837 86.10804-210.231185l93.762088-153.208527 93.762088 153.208527c86.10804 140.706916 86.10804 193.137144 86.10804 210.231185 0 99.247489-80.750206 179.870128-179.870128 179.870128z m0-396.607253l-28.447545 46.434557C83.811826 501.467711 76.54048 547.009297 76.54048 561.42442c0 56.89509 46.30699 103.329648 103.329648 103.329648s103.329648-46.30699 103.329648-103.329648c0-14.415124-7.271346-59.956709-74.882103-170.302568l-28.447545-46.434557z"
                    p-id="1513" fill="#1afa29"></path>
                <path
                    d="M220.436582 592.16818m-28.319977 0a28.319978 28.319978 0 1 0 56.639955 0 28.319978 28.319978 0 1 0-56.639955 0Z"
                    p-id="1514" fill="#1afa29"></path>
                <path
                    d="M138.538269 563.97577m-28.319978 0a28.319978 28.319978 0 1 0 56.639955 0 28.319978 28.319978 0 1 0-56.639955 0Z"
                    p-id="1515" fill="#1afa29"></path>
                <path
                    d="M192.116605 494.834203m-28.319978 0a28.319978 28.319978 0 1 0 56.639955 0 28.319978 28.319978 0 1 0-56.639955 0Z"
                    p-id="1516" fill="#1afa29"></path>
            </svg>
            <h2 class="panel-title">农业概况</h2>
        </div>
        <div class="data_grid">
            <!-- 种植情况 -->
            <div class="plant">
                <div class="overview">
                    <img src="@/assets/imgs/ecological_agriculture.png" draggable="false">
                    <div class="overview-text">
                        <h1>总种植面积</h1>
                        <h1 class="overview-text-data">{{ agriculturalAreaSummary?.thisYearTotalCultivation + ' 亩' }} </h1>
                    </div>
                    <!-- <div class="divider"></div> -->
                    <el-divider direction="vertical" />
                    <h1 class="year-rate-text">年同比</h1>
                    <span class="year-rate">{{ agriculturalAreaSummary?.yearOnYearCultivationRate }}</span>
                </div>
            </div>
            <!-- 养殖情况 -->
            <div class="breed">
                <div class="overview">
                    <img src="@/assets/imgs/breed.png" draggable="false">
                    <div class="overview-text">
                        <h1>总养殖面积</h1>
                        <h1>{{ agriculturalAreaSummary?.thisYearTotalBreeding + ' 亩' }} </h1>
                    </div>
                    <el-divider direction="vertical" />
                    <h1 class="year-rate-text">年同比</h1>
                    <span class="year-rate">{{ agriculturalAreaSummary?.yearOnYearBreedingRate }}</span>
                </div>
            </div>
        </div>
    </section>
</template>

<style scoped>
.year-rate-text {
    font-family: '黑体';
    color: #32b885;
    font-size: 20px;
}

.year-rate {
    color: white;
}

.el-divider {
    height: 100px;
    border-color: #46a776;
    border-width: 2px;
    filter: blur(2px);

}

.data_grid {
    display: flex;
    flex-direction: column;
    gap: 20px;
    h1 {
            font-size: 1.2em;
            /* 减小字体大小 */
            color: #ffffff;
            margin-bottom: 15px;
        }
}

img {
    width: 30%;
    height: 30%;
    margin-bottom: 20px;
    /* 调整图片底部间距 */
}

h1 {
    font-size: 1.5em;
    color: #ffffff;
    /* 深色标题 */
    margin-bottom: 15px;
}

.overview {
    display: flex;
    align-items: center;
    position: relative;
    width: 100%;
}

.breed {
    margin-top: -20px;
    /* 调整 breed 和 plant 之间的间距 */
}

.overview-text {
    display: flex;
    flex-direction: column;
    margin-left: 10px;
}

.icon {
    fill: #1afa29;
}

.chart-background {
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    opacity: 0.4;
    /* 调整图表背景的透明度 */
    z-index: -1;
    /* 将图表置于内容下方 */
}

.mini-chart {
    width: 100%;
    height: 100%;
}

.data-point-label {
    font-size: 0.3rem;
    /* 更小的字体 */
    fill: #ffffff;
    /* 柔和的文本颜色，与 data-value 颜色一致 */
    opacity: 1;
    /* 稍微降低透明度，使其不那么突出 */
    /* text-shadow: 0 0 1px rgba(0, 0, 0, 0.5);  可以添加可选的文字阴影 */
    /* pointer-events: none;  防止文本标签干扰鼠标事件（如果需要） */
}
</style>